export const STAR_SYSTEMS = [
  { id:'ODIN',         name:'오딘',        faction:'REH',   type:'capital',  x:645, y:230, population:250, industry:95, defense:90, isGateway:false, fortress:null },
  { id:'GAISHBURG',    name:'가이스부르크',faction:'REH',   type:'fortress', x:545, y:88,  population:60,  industry:70, defense:95, isGateway:false, fortress:'GAISHBURG' },
  { id:'NEUE_LAND',    name:'노이에란트',  faction:'REH',   type:'frontier', x:755, y:78,  population:80,  industry:55, defense:60, isGateway:false, fortress:null },
  { id:'RENTENBERG',   name:'렌텐베르크', faction:'REH',   type:'normal',   x:715, y:355, population:90,  industry:60, defense:50, isGateway:false, fortress:null },
  { id:'KAPCHE_LANKA', name:'카프체란카', faction:'REH',   type:'frontier', x:555, y:408, population:40,  industry:35, defense:45, isGateway:false, fortress:null },
  { id:'HEINESSEN',    name:'하이네센',   faction:'FPA', type:'capital',  x:88,  y:265, population:220, industry:90, defense:85, isGateway:false, fortress:null },
  { id:'TIAMAT',       name:'티아마트',   faction:'FPA', type:'fortress', x:215, y:88,  population:50,  industry:60, defense:85, isGateway:false, fortress:'TIAMAT' },
  { id:'URUVASI',      name:'우르바시',   faction:'FPA', type:'normal',   x:62,  y:80,  population:70,  industry:50, defense:45, isGateway:false, fortress:null },
  { id:'SHAMLUU',      name:'샤므루',     faction:'FPA', type:'normal',   x:108, y:400, population:60,  industry:45, defense:40, isGateway:false, fortress:null },
  { id:'LEGNICA',      name:'레그니차',   faction:'FPA', type:'frontier', x:295, y:205, population:55,  industry:40, defense:50, isGateway:false, fortress:null },
  { id:'ISERLOHN',     name:'이젤론',     faction:'REH',   type:'fortress', x:425, y:238, population:20,  industry:50, defense:99, isGateway:true,  fortress:'ISERLOHN' },
  { id:'PHEZZAN',  name:'페잔',       faction:'PZN',  type:'capital',  x:408, y:402, population:150, industry:99, defense:60, isGateway:true,  fortress:null },
  { id:'AMLITZER',     name:'아므리차',   faction:null,       type:'contested',x:355, y:195, population:10,  industry:20, defense:20, isGateway:false, fortress:null },
  { id:'VERMILION',    name:'버밀리온',   faction:null,       type:'contested',x:492, y:195, population:10,  industry:20, defense:20, isGateway:false, fortress:null },
]
// [23000100]간다르바	
// 	        [23000101]우르바시
// 	        [23000102]프라바스
// [23000200]다곤	
// 	        [23000201]카프튜랑카
// [23000300]도리아	
// 	        [23000301]델모퓌라이
// 	        [23000302]보이오이아
// [23000400]라이갈	
// 	        [23000401]마그 토레드
// [23000500]란테마리오	
// 	        [23000501]라티고스트
// 	        [23000502]스벤트비트
// 	        [23000503]야로비트
// [23000600]로포덴	
// 	        [23000601]키베론
// 	        [23000602]루드밀라
// [23000700]룬비니	
// 	        [23000701]카스티리오네
// [23000800]뤼카스	
// 	        [23000801]비트리아
// [23000900]리오 베르데	
// 	        [23000901]아로요 드 모리노
// 	        [23000902]카시나
// [23001000]리텐하임	
// 	        [23001001]퀴스트린
// 	        [23001002]에르뮐
// [23001100]리히텐라데	
// 	        [23001101]에르힌겐
// [23001200]마르바흐	
// 	        [23001201]민덴
// [23001300]마린도르프	
// 	        [23001301]테레젠슈타트
// [23001400]마르 아데타	
// 	        [23001401]파프라비
// [23001500]바라투르프	
// 	        [23001501]프르샤 스쿠타
// [23001600]바라트	
// 	        [23001601]하이네센
// 	        [23001602]시뤼나갈
// 	        [23001603]테르누젠
// [23001700]바르텐베르크	
// 	        [23001701]브렌하임
// 	        [23001702]카르슈타트
// [23001800]발할라	
// 	        [23001801]오딘
// 	        [23001802]아스가르즈
// 	        [23001803]유그드라실
// [23001900]밴플리트	
// 	        [23001901]카토르브러
// [23002000]버밀리온	
// 	        [23002001]몽마라유
// [23002100]보덴	
// 	        [23002101]보르소른
// 	        [23002102]빌로스트
// 	        [23002103]알비스
// [23002200]브라운슈바이크	
// 	        [23002201]톤도르프
// 	        [23002202]베스타란트
// [23002300]빌렌슈타인	
// 	        [23002301]레오폴트슈타트
// 	        [23002302]그라츠
// [23002400]샤헨	
// 	        [23002401]슈바르츠부르크
// [23002500]샨다르아	
// 	        [23002501]알에리스
// [23002600]샨다우	
// 	        [23002601]에스링그
// 	        [23002602]크네스도르프
// 	        [23002603]폰트노이
// [23002700]슈팔라	
// 	        [23002701]에레키슈갈
// [23002800]시바	
// 	        [23002801]미트라
// 	        [23002802]지비에
// [23002900]아레스하임	
// 	        [23002901]탄므즈
// [23003000]아스타데	
// 	        [23003001]아트라 하시스
// 	        [23003002]아스페륀
// 	        [23003003]우가리트
// [23003100]아이젠헤르츠	
// 	        [23003101]베스트파리아
// 	        [23003102]디사우
// [23003200]아이젠후트	
// 	        [23003201]다룸슈타트
// [23003300]알멘트푸벨	
// 	        [23003301]바텐 도라흐
// [23003400]알테너	
// 	        [23003401]가이에스부르크
// 	        [23003402]헷세 카셀
// [23003500]암릿처	
// 	        [23003501]클라잉겔트
// 	        [23003502]도벨그
// 	        [23003503]모르겐
// [23003600]에뤼세라	
// 	        [23003601]악타이온
// [23003700]에크하르트	
// 	        [23003701]자크스 코프르크
// [23003800]엘 파실	
// 	        [23003801]엘 파실
// 	        [23003802]에스트레마도라
// [23003900]엘곤	
// 	        [23003901]샴프르
// 	        [23003902]보프 마나프
// 	        [23003903]메헤라브
// [23004000]요툰하임	
// 	        [23004001]로스바흐
// [23004100]이제르론	
// 	        [23004101]이제르론
// [23004200]잠시드	
// 	        [23004201]다프테 잠시드
// 	        [23004202]카퍼
// [23004300]카스트로프	
// 	        [23004301]케니히그라흐
// 	        [23004302]라파트
// [23004400]케륨	
// 	        [23004401]네프티스
// 	        [23004402]이제크온
// [23004500]키포이져	
// 	        [23004501]가르미슈
// 	        [23004502]스루즈헤임
// 	        [23004503]가랴르호른
// [23004600]타나투스	
// 	        [23004601]에코니아
// 	        [23004602]마스지드
// [23004700]타시리	
// 	        [23004701]파라스
// [23004800]트라바흐	
// 	        [23004801]호포키르히
// 	        [23004802]비텐베르크
// [23004900]트리폴라	
// 	        [23004901]팔머랜드
// [23005000]티아매트	
// 	        [23005001]라므
// 	        [23005002]안샤르
// 	        [00000000]레그니처
// [23005100]파이어져드	
// 	        [23005101]우가리트
// 	        [23005102]라트보트
// [23005200]팔란티아	
// 	        [23005201]케르코포르타
// [23005300]페잔	
// 	        [23005301]페잔
// [23005400]포레비트	
// 	        [23005401]루지아나
// [23005500]포르겐	
// 	        [23005501]루지아나
// [23005600]프레이아	
// 	        [23005601]렌텐베르크
// 	        [23005602]니플헤임
// [23005700]하안	
// 	        [23005701]자르펠트
	
// [23006000]닛슈우히더스	
// 	        [23010101]
// [23006100]레자빅	
// [23006200]파라파라	
// [23006300]프레뷔도	
// 	        [23006301]슈바라
	
// [23006400]태양계	
// 	        [23006401]지구
// [23006500]시리우스	
// 	        [23006506]론드리나
// [23006600]베텔기우스	
// 	        [23006601]
// [23006700]카노프스	
// [23006800]알타이르	

// [23006900]프록시마	