A.D 2039 - 13일 전쟁
A.D 2039 ~ 2129 - 90년 전쟁
A.D 2129 - 지구통일정부 수립, 수도를 브리즈번에 정하다.
A.D 2166 - 목성의 위성 이오에 개발 기지 건설.
A.D 2180 - 명왕성 탐사단 파견.
A.D. 2253 - 알파 센타우리로 탐사대 파견. 태양계를 벗어난 첫 타 항성계 진출.
A.D. 2360 - 초광속 항행기술 발명
A.D. 2391 - 초광속 항행기술 상용화
A.D. 2402 - 카노프스 성계에 인류가 살 수 있는 행성 발견.
A.D. 2404 - 카노프스 성계로 제1차 항성이민단 파견
A.D. 2682 - 식민성 주민들이 지구통일정부에 내정간섭 금지, 군비 축소 등의 내용이 담긴 요구사항 제출
A.D 2689 ~ 2704 - 시리우스 전역
A.D 2689 - 지구통일정부, 시리우스 성계 점령
A.D 2690 - 블러디 나이트
A.D 2691 - 라그랑 그룹 출범
A.D 2703 - 제2차 베가 회전
A.D 2704 - 지구통일정부 붕괴
A.D. 2706 - 칼레 팔름그렌 병사, 졸리오 프랑쿠르, 차오 유이룽 암살
A.D 2707 - 윈슬로 케네스 타운젠트 암살, 라그랑 그룹 붕괴
3.2. 우주력 1년[편집]
SE 001, A.D 2801 - 은하연방 건국
SE 106, A.D 2906 - 우주해적 토벌작전 시작
SE 108, A.D 2908 - 우주해적 토벌작전 종료
SE 296, A.D 3096 - 루돌프 폰 골덴바움 퇴역, 정계 투신
SE 310, RC 001, A.D 3110 - 은하제국 건국, 루돌프 대제 즉위
SE 318, RC 009, A.D 3118 - 열악유전자 배제법 선포, 제국의회 해산
SE 319, RC 010, A.D 2119 - 사회질서유지국 설립
SE 351, RC 042, A.D 3151 - 루돌프 대제 사망, 지기스문트 1세 즉위, 공화주의자의 대반란
SE 433, RC 124, A.D. 3233 - 에크하르트 백작의 반란, 공위 140일
SE 453, RC 144, A.D. 3453 - 율리우스 황제 독살, 칼 대공 유폐
SE 469, RC 160, A.D 3469 - 지기스문트 2세 폐위
SE 473, RC 164, A.D 3273 - 장정 1만 광년 시작
SE 527, RC 218, A.D 3327 - 장정 1만 광년 종료. 자유행성동맹 건국
SE 562, RC 253, A.D 3362 - 린더호프 후작의 반란, 트라바흐 성역 회전, 아우구스트 2세 암살
3.3. 외전[편집]
SE 640, RC 331, A.D 3440 - 자유행성동맹과 은하제국의 첫 접촉. 제국-동맹 전쟁의 시작. 다곤 성역 회전, 검붉은 6년 시작
SE 646, RC 337, A.D 3446 - 막시밀리안 요제프 2세 즉위, 검붉은 6년 종료
SE 668, RC 359, A.D 3468 - 코르넬리우스 1세의 친정
SE 682, RC 373, A.D 3482 - 페잔 자치령 창건
SE 696, RC 387, A.D 3496 - 샨달라 성역 회전[A]
SE 717, RC 408, A.D 3517 - 텔레만 제독 휘하 병사 반란 사건[2]
SE 728, RC 419, A.D 3528 - 지크마이스터 제독 망명사건, 포르세티 성역 회전[A]
SE 738, RC 429, A.D 3538 - 파이어저드 성역 회전
SE 742. RC 433. A.D 3542 - 드라고니아 성역 회전★[4]
SE 745, RC 436, A.D 3545 - 제2차 티아마트 회전
SE 751, RC 442, A.D 3551 - 팔란티아 회전, 미켈젠 제독 암살사건
SE 763, RC 454, A.D 3563 - 이제르론 요새 기공
SE 765, RC 456, A.D 3565 - 프리드리히 4세 즉위[5]
SE 767, RC 458, A.D 3567 - 이제르론 요새 완공
SE 788, RC 479, A.D 3588
엘 파실 전투
에코니아 포로수용소 사건
SE 790, RC 481, A.D 3590 - 앤드류 포크 사관학교 수석 졸업
SE 791, RC 482, A.D 3591
라인하르트 폰 뮈젤 1차 암살미수사건
하멜른 2호 조난사건★
SE 792, RC 483, A.D 3592
라인하르트 폰 뮈젤 2차 암살미수사건★
아를레스하임 성역 회전
제5차 이제르론 공방전
라인하르트 폰 뮈젤 3차 암살미수사건
지향성 제플입자 발생기 탈환 작전★
SE 793, RC 484, A.D 3593 - 은하제국 유년학교 살인사건
SE 794, RC 485, A.D 3594
반플리트 성역 회전
제6차 이제르론 공방전
SE 795, RC 486, A.D 3595
제3차 티아마트 회전
클롭슈톡 사건
베네뮌데 후작부인 사건
그랜드 캐널 사건
레그니처 상공 조우전
제4차 티아마트 회전
사이옥신 마약 사건
3.4. 정전[편집]
SE 796, RC 487, A.D 3596
아스타테 회전
양 웬리 준장 관사 침입사건
제7차 이제르론 공방전
카스트로프 동란
제임스 손다이크 암살사건★
제국령 침공작전
암릿처 회전
유령 소동
SE 797, RC 488, A.D 3597
이제르론 헌병대장 인질사건
동맹&제국 포로교환
돌튼 사건
립슈타트 전역
슈바르첸 관저 습격사건
알테너 회전
렌텐베르크 요새 공방전
키포이저 성역 회전
샨타우 성역 회전
제1차 가이에스부르크 요새 공방전
베스터란트 학살사건
제2차 가이에스부르크 요새 공방전
라인하르트 폰 로엔그람 1차 암살미수사건(지크프리트 키르히아이스 사망)
구국군사회의 쿠데타
쿠브르슬리 대장 암살미수사건
행성 샴풀 해방전
도리아 성역 회전
스타디움 학살 사건
하이네센 공방전
회랑의 조우전
SE 798, RC 489, A.D 3598
사문회
제8차 이제르론 공방전(요새 대 요새 전투)
황제 납치 사건
은하제국 정통정부 수립: 8월 20일
제1차 라그나뢰크 작전
제9차 이제르론 공방전
페잔 점령 작전
율리안 민츠의 페잔 탈출
SE 799, RC 490, NRC(신제국력) 001, A.D 3599
제1차 라그나뢰크 작전
제1차 란테마리오 성역 회전
양 웬리 원수 등극(2월 13일)
수송선단 습격전
라이가르 성역 회전
타실리 성역 회전
버밀리온 성역 회전
바라트 화약
골덴바움 왕조 멸망: 6월 20일
로엔그람 왕조 건국: 6월 22일
큄멜 사건
양 웬리 원수 모살미수사건
엘 파실 독립정부 수립: 8월 13일
지구교 본거지 토벌 작전
제2차 라그나뢰크 작전
SE 800, NRC 002, A.D 3600
제2차 라그나뢰크 작전
제10차 이제르론 공방전
마르 아데타 성역 회전
겨울장미원의 칙령
로이엔탈 원수 탄핵사건
하이네센 대화재
페잔 폭탄테러사건
회랑 전투
양 웬리 암살사건
엘 파실 독립정부 해산: 6월 6일
이제르론 공화정부 수립: 8월 8일
라인하르트 폰 로엔그람 2차 암살미수사건
응웬 킴 호아 광장 사건
노이에란트 전역
우르바시 사건
제2차 란테마리오 회전
SE 801, NRC 003, A.D 3601
하이네센 동란
제11차 이제르론 공방전
오베르슈타인의 풀베기
라그풀 교도소 폭동사건
호랑가시나무관 습격사건
시바 성역 회전
루빈스키의 불 축제
벨제데 임시 황궁 습격사건