// | 코드값 | 국체 | 정체 / 체제         |
// | --- | -- | --------------- |
// | 1   | 없음 | 무정부 상태          |
// | 8   | 없음 | 아나키즘(무정부주의)     |
// | 15  | 공화 | 직접민주주의          |
// | 22  | 공화 | 협동조합주의          |
// | 35  | 공화 | 민주집중제           |
// | 42  | 공화 | 기술관료제           |
// | 50  | 공화 | 과두제             |
// | 58  | 공화 | 기업국가            |
// | 70  | 공화 | 귀족공화제           |
// | 85  | 공화 | 신권정치            |
// | 100 | 공화 | 민주공화제           |
// | 115 | 공화 | 신대통령제           |
// | 130 | 공화 | 대통령독재           |
// | 145 | 공화 | 일당 독재           |
// | 160 | 공화 | 군정(軍政)          |
// | 180 | 혼합 | 혼합 체제           |
// | 195 | 군주 | 근대군주제           |
// | 210 | 군주 | 비주권군주제          |
// | 225 | 군주 | 입헌군주제           |
// | 240 | 군주 | 전제군주제           |
// | 255 | 군주 | 절대왕정 / 신성군주제 극단 |
